Tekla.Structures.Model.SurfaceTreatment.SurfaceTypeEnum
The different surfacing types.

Tekla.Structures.Model.SurfaceTreatment.SurfaceTypeEnum.CONCRETE_FINISH
The concrete finish surface type.

Tekla.Structures.Model.SurfaceTreatment.SurfaceTypeEnum.SPECIAL_MIX
The special mix surface type.

Tekla.Structures.Model.SurfaceTreatment.SurfaceTypeEnum.TILE_SURFACE
The tile surface type.

Tekla.Structures.Model.SurfaceTreatment.SurfaceTypeEnum.STEEL_FINISH
The steel finish surface type.